Repository: karthi3345/Greatkart_django
Catalog: myapp/myapp/locale/*/LC_MESSAGES/django.po
Languages: te

source: English
te: ఇంగ్లీష్

source: Tamil
te: తమిళం

source: Hindi
te: హిందీ

source: Telugu
te: తెలుగు

source: Kannada
te: కన్నడ

source: Main Banner
te: ప్రధాన బ్యానర్

source: See all
te: అన్నీ చూడండి

source: Popular Products
te: జనాదరణ పొందిన ఉత్పత్తులు

source: Contact us at
te: మమ్మల్ని సంప్రదించండి

source: Street Name 123
te: వీధి పేరు 123

source: Language
te: భాష

source: RUBL
te: రుద్దు

source: Email
te: ఇమెయిల్

source: Call us
te: మాకు కాల్ చేయండి

source: All Categories
te: అన్ని వర్గాలు

source: All Products
te: అన్ని ఉత్పత్తులు

source: Store
te: స్టోర్

source: Search goods...
te: వస్తువులను వెతకండి...

source: Welcome guest!
te: స్వాగతం అతిథి!

source: Sign in
te: సైన్ ఇన్ చేయండి

source: Register
te: నమోదు చేసుకోండి

source: Choose Color
te: రంగును ఎంచుకోండి

source: Silver
te: వెండి

source: Gray
te: బూడిద

source: Gold
te: బంగారం

source: Black
te: నలుపు

source: Select Size
te: పరిమాణాన్ని ఎంచుకోండి

source: S
te: ఎస్

source: M
te: ఎం

source: L
te: ఎల్

source: XL
te: ఎక్స్ట్రా లార్జ్

source: Add to cart
te: కార్ట్‌కి జోడించండి

source: Customer Reviews
te: కస్టమర్ రివ్యూలు

source: Mike John
te: మైక్ జాన్

source: Dummy comment Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip
te: డమ్మీ వ్యాఖ్య లోరెమ్ ఇప్సమ్ డోలర్ సిట్ అమెట్, కాన్సెక్టెర్ అడిపిసిసింగ్ ఎలిట్, సెడ్ డో యూస్మాడ్ టెంపోర్ ఇన్సిడిడెంట్ యుట్ లేబర్ మరియు డోలోర్ మాగ్నా అలీవా. ఉల్ ఎనిమ్ అడ్ మినిమ్ వెనియం, క్విస్ నోస్ట్రడ్ ఎక్సర్‌సిటేషన్ ఉల్లంకో లేబర్స్ నిసి యుట్ అలీక్విప్

source: Sizes
te: పరిమాణాలు

source: Price range
te: ధర పరిధి

source: Min
te: కనిష్ట

source: Max
te: గరిష్టంగా

source: Apply
te: దరఖాస్తు చేసుకోండి

source: Items found
te: వస్తువులు దొరికాయి

source: Previous
te: మునుపటి

source: Next
te: తదుపరి
